NetBSD/src/external/ibm-public/postfix/dist/src/tls/tlsrpt_wrapper.c
/*	$NetBSD: tlsrpt_wrapper.c,v 1.1.1.2 2026/05/09 18:39:22 christos Exp $	*/

/*++
/* NAME
/*	tlsrpt_wrapper 3
/* SUMMARY
/*	TLSRPT support for the SMTP and TLS protocol engines
/* SYNOPSIS
/*	#include <tlsrpt_wrapper.h>
/*
/*	#ifdef USE_TLS
/*	#ifdef USE_TLSRPT
/*	TLS_RPT *trw_create(
/*	const char *rpt_socket_name,
/*	const char *rpt_policy_domain,
/*	const char *rpt_policy_string,
/*	int	skip_reused_hs)
/*
/*	void	trw_free(
/*	TLSRPT_WRAPPER *trw)
/*
/*	void	trw_set_tls_policy(
/*	TLSRPT_WRAPPER *trw,
/*	tlsrpt_policy_type_t tls_policy_type,
/*	const char *const *tls_policy_strings,
/*	const char *tls_policy_domain
/*	const char *const *mx_host_patterns)
/*
/*	void	trw_set_tcp_connection(
/*	TLSRPT_WRAPPER *trw,
/*	const char *snd_mta_addr,
/*	const char *rcv_mta_name,
/*	const char *rcv_mta_addr)
/*
/*	void	trw_set_ehlo_resp(
/*	TLSRPT_WRAPPER *trw,
/*	const char *rcv_mta_ehlo)
/*
/*	void	trw_report_failure(
/*	TLSRPT_WRAPPER *trw,
/*	tlsrpt_failure_t failure_type,
/*	const char *additional_info,
/*	const char *failure_reason)
/*
/*	void	trw_report_success(
/*	TLSRPT_WRAPPER *trw)
/*
/*	int	trw_is_reported(
/*	TLSRPT_WRAPPER *trw)
/*
/*	int	trw_is_skip_reused_hs(
/*	TLSRPT_WRAPPER *trw)
/*
/*	tlsrpt_policy_type_t convert_tlsrpt_policy_type(
/*	const char *policy_type)
/*
/*	tlsrpt_failure_t convert_tlsrpt_policy_failure(
/*	const char *policy_failure)
/*	#endif /* USE_TLS_RPT */
/*
/*	int	valid_tlsrpt_policy_type(
/*	const char *type_name)
/*
/*	int	valid_tlsrpt_policy_failure(
/*	const char *failure_name)
/*	#endif /* USE_TLS */
/* POSTFIX ARCHITECTURE, BOTTOM-UP VIEW
/* .ad
/* .fi
/*	This module encapsulates TLSRPT support for Postfix's
/*	multi-process and multi-layer architecture. The text that follows
/*	explains the purpose of this software layer.
/*
/*	First, Postfix TLSRPT support uses the TLSRPT client library
/*	from sys4.de. That library makes the reasonable assumption that
/*	all calls concerning one SMTP session will be made from within
/*	one process.
/*
/*	Second, some TLS errors are detected in the SMTP protocol
/*	engine (example: a remote SMTP server does not announce STARTTLS
/*	support), while other TLS errors are detected in the TLS protocol
/*	engine (example: certificate verification error).
/*
/*	Third, the Postfix TLS protocol engine may be located in a
/*	different process than the SMTP protocol engine. And even if the
/*	two are located in the same process, the TLS protocol engine knows
/*	nothing about SMTP. Hence, there needs to be an abstraction that
/*	isolates the TLS protocol engine from the SMTP-specific details
/*	of TLSRPT.
/*
/*	Fourth, Postfix has a pipelined and layered architecture where
/*	each process (or architectural layer) handles a problem as it
/*	runs into it, instead of reporting problem details back to its
/*	pipeline predecessor (or back to a higher architectural layer).
/* TLSRPT_WRAPPER IMPLEMENTATION
/* .ad
/* .fi
/*	At a high level, the SMTP protocol engine encapsulates SMTP
/*	session and TLS policy information in an opaque TLSRPT_WRAPPER
/*	object, and passes that object to the TLS protocol engine. The
/*	TLS protocol engine can invoke TLSRPT_WRAPPER methods to report a
/*	TLS error through the sys4.de TLSRPT client library. In a similar
/*	manner, the SMTP protocol engine can invoke TLSRPT_WRAPPER object
/*	methods to report a TLS error or success.
/*
/*	At a low level, The Postfix SMTP protocol engine (smtp_proto.c)
/*	reports TLS errors when TLS support is required but unavailable,
/*	or requests the Postfix TLS protocol engine to perform a TLS
/*	protocol handshake over an open SMTP connection. The SMTP
/*	protocol engine either calls the TLS protocol engine directly,
/*	or calls it over local IPC in a tlsproxy(8) process.
/*
/*	The TLS protocol engine may report a TLS error by invoking
/*	TLSRPT_WRAPPER methods, and either returns no TLS session object,
/*	or a TLS session object for a completed handshake. The TLS session
/*	object will indicate if the TLS protocol engine reported any
/*	TLS error through TLSRPT (for example an error that resulted in
/*	a successful TLS handshake with a downgraded TLS security level).
/*
/*	The Postfix SMTP protocol engine reports success or failure
/*	by invoking TLSRPT_WRAPPER methods, depending on whether all
/*	matching requirements were satisfied. The SMTP protocol engine
/*	does not report success or failure by invoking TLSRPT_WRAPPER
/*	methods if the TLS protocol engine already reported a failure.
/* TLSRPT_WRAPPER API
/* .ad
/* .fi
/*	The functions below must be called in a specific order. All
/*	string inputs are copied. If a required call is missing then
/*	the request will be ignored, and a warning will be logged,
/*	but this not affect email deliveries.
/* .PP
/*	trw_create() must be called before other trw_xxx() requests can
/*	be made. Arguments:
/* .IP rpt_socket_name
/*	The name of a socket that will be managed by local TLSRPT
/*	infrastructure.
/* .IP rpt_policy_domain
/*	The TLSRPT policy domain name, i.e. the domain that wishes to
/*	receive TLSRPT summary reports. An internationalized domain name
/*	must be in A-label form (i.e. punycode).
/* .IP rpt_policy_string
/*	The TLSRPT policy record content, i.e. how to submit TLSRPT
/*	summary reports.
/* .IP skip_reused_hs
/*	If non-zero, do not report the TLSRPT status for TLS handshakes
/*	that reuse a previously-negotiated TLS session; such sessions
/*	were already reported when they were used for the first time.
/* .PP
/*	trw_free() destroys storage allocated with other trw_xxx()
/*	requests.
/* .PP
/*	trw_set_tls_policy() must be called by the SMTP protocol engine
/*	after it found a DANE, STS, or no policy, and before it tries to
/*	establish a new SMTP connection. This function clears information
/*	that was specified earlier with trw_set_tls_policy() or
/*	trw_set_tcp_connection(), and resets whether trw_report_failure()
/*	or trw_report_success() were called. Mapping from arguments to
/*	TLSRPT report fields:
/* .IP tls_policy_type
/*	policies[].policy.policy-type.
/* .IP tls_policy_strings (may be null)
/*	policies[].policy.policy-string[]. Ignored if the tls_policy_type
/*	value is TLSRPT_NO_POLICY_FOUND.
/* .IP tls_policy_domain (may be null)
/*	policies[].policy.policy-domain. If null, this defaults to the
/*	TLSRPT policy domain.
/* .IP mx_host_patterns (may be null)
/*	policies[].policy.mx-host[]. Ignored if the tls_policy_type
/*	value is TLSRPT_NO_POLICY_FOUND.
/* .PP
/*	trw_set_tcp_connection() and trw_set_ehlo_resp() are optionally
/*	called by the SMTP protcol engine, after it has established
/*	a new SMTP connection, before it requests a TLS protocol
/*	handshake. Mapping from arguments to TLSRPT report fields:
/* .IP snd_mta_addr (may be null)
/*	policies[].failure-details[].sending-mta-ip.
/* .IP rcv_mta_name (may be null)
/*	policies[].failure-details[].receiving-mx-hostname.
/* .IP rcv_mta_addr (may be null)
/*	policies[].failure-details[].receiving-ip.
/* .PP
/*	trw_set_ehlo_resp() is optionally called by the SMTP protcol
/*	engine to pass on the EHLO response. Presumably this is the EHLO
/*	response before STARTTLS (TLSRPT is primarily interested in
/*	pre-handshake and handshake errors).
/* .IP rcv_mta_ehlo (may be null)
/*	policies[].failure-details[].receiving-mx-helo.
/* .PP
/*	trw_report_failure() is called by the TLS protocol engine or
/*	SMTP protocol engine to report a TLS error. The result value
/*	is 0 for success, -1 for failure as indicated with the errno
/*	value. The call is successfully skipped if information is missing
/*	or if failure or success were already reported for the
/*	connection. Mapping from arguments to TLSRPT report fields:
/* .IP failure_type
/*	policies[].failure-details[].result-type.
/* .IP additional_info (may be null)
/*	policies[].failure-details[].additional-information.
/* .IP failure_reason (may be null)
/*	policies[].failure-details[].failure-reason-code
/* .PP
/*	trw_report_success() is called by the SMTP protocol engine
/*	to report a successful TLS handshake. The result value is
/*	0 for success, -1 for failure with errno indicating the
/*	error type. The call is successfully skipped if information if
/*	missing or if failure or success were already reported for
/*	the connection.
/* .PP
/*	trw_is_reported() returns non-zero when the contents of the
/*	specified TLSRPT_WRAPPER have been reported.
/* .PP
/*	trw_is_skip_reused_hs() returns non-zero if the skip_reused_hs
/*	argument of trw_create() was non-zero.
/* .PP
/*	convert_tlsrpt_policy_type() and convert_tlsrpt_policy_failure()
/*	convert a valid policy type or failure name to the corresponding
/*	enum value. The result is < 0 if the name is not valid.
/* .PP
/*	valid_tlsrpt_policy_type() and valid_tlsrpt_policy_failure()
/*	return non-zero if the specified policy type or failure name
/*	is valid in TLSRPT. These functions do not require that the
/*	module is built with TLSRPT support. This allows the names to
/*	be used even if TLSRPT is disabled.
/* DIAGNOSTICS
/*	Some functions will log a warning when information is missing.
/*	Such warnings will not affect the operation of the SMTP or TLS
/*	protocol engine.
/* BUGS
/*	This implementation is suitable to report successful TLS policy
/*	compliance, and to report a failure that prevents TLS policy
/*	compliance (example: all TLSA records are unusable). Do not use
/*	this implementation to report other errors (example: some TLSA
/*	record is non-parsable).
/* SEE ALSO
/*	https://github.com/sys4/tlsrpt, TLSRPT client library
/* LICENSE
/* .ad
/* .fi
/*	The Secure Mailer license must be distributed with this software.
/* AUTHOR(S)
/*	Wietse Venema
/*	porcupine.org
/*--*/

#if defined(USE_TLS)

